[
  {
    "path": "posts/parquet_com_R/",
    "title": "Parquet para grandes conjuntos de dados no R",
    "description": "O formato csv, largamente utilizado, tem limitações quando o conjuntos de dados é grande. O Apache Parquet é uma excelente alternativa, e este post apresenta como trabalhar com esse formato de arquivo orientado a colunas, utilizando R e as bibliotecas arrow e sparklyr.",
    "author": [
      {
        "name": "Jonatas Silva do Espirito Santo",
        "url": "https://github.com/jonates/"
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\r\n\r\nbody {\r\ntext-align: justify}\r\nMesmo depois de décadas de sua implementação, é rotina entre as intituições, sejam do setor privado, seja nas instituições públicas, armazenar dados em um arquivo csv (“comma-separated-values”), que como próprio significado da sigla já diz, é um arquivo com valores separados por vírgulas. Vale ressaltar que, como no Brasil a vírgula é utilizada como separador de la decimal, é prática comum utilizar o sinal ponto e vírgula (;) como separador de valores, em vez de usar o sinal vírgula.\r\nPor ser bastante difundido e de fácil manipulação (a depender do tamanho do arquivo, é possível abrir em um bloco de notas e consultar/editar o arquivo de dados csv), a maioria dos softwares e aplicativos, tem suporte para leitura e gravação de arquivos csv.\r\nNesses tipos de arquivos, cada linha representa um registro, e os valores dos campos associados a esses registros são separados por vírgula (ou ponto e vírgula). Por exemplo, suponha que seja de interesse, armazenar em um arquivo csv com informações básicas das últimas 5 copas do mundo de futebol masculino da FIFA. Poderia simplesmente abrir um bloco de notas, digitar o texto abaixo e depois salvar com a extensão .csv:\r\nsede,campeão,ano\r\nRússia,França,2018\r\nBrasil,Alemanha,2014\r\nÁfrica do Sul,Espanha,2010\r\nAlemanha,Itália,2006\r\nCoréia do Sul e Japão,Brasil,2002\r\n\r\nPorém, apesar das diversas vantagens, quando o número de registros e de campos aumentam de forma considerável, a leitura desses arquivos passam a ter custo computacional elevado, pois o csv é um arquivo “row oriented dataset” (ou ainda chamado também de “row storage”), ou seja, como o próprio nome define, é conjunto de dados orientados a linha, e assim, a leitura do arquivo é feito linha a linha. Portanto, mesmo que o interesse de análise seja de uma ou de algumas colunas específicas, todas as colunas serão lidas, diminuindo assim a performance.\r\nEntão, o formato de arquivos Apache parquet, que é um “column oriented dataset”, ou seja, conjunto de dados orientado a colunas, se torna uma excelente alternativa ao .csv para gravar grandes conjuntos de dados para análise, pois, além de leitura mais rápida, a taxa de compressão desses arquivos é muito maior em relação aos .csv ocupando menos espaço em disco.\r\nO conjunto de dados de exemplo\r\nVamos utilizar como exemplo, dados do censo escolar 2019, realizado pelo Ministério da Educação do Brasil. Os microdados, são disponibilizados para download no site do INEP - Instituto Nacional de Estudos e Pesquisas Educacionais Anísio Teixeira.\r\nO download é de um arquivo microdados_educacao_basica_2019 compactado com extensão .zip, cujo conteúdo é uma pasta contendo quatro pastas ANEXOS, DADOS, FILTROS, LEIA-ME.\r\nNa pasta DADOS existem 15 conjuntos de dados em formato .csv.\r\nPor exemplo, o arquivo MATRICULA_NORDESTE.CSV que é o conjunto de dados com informações de cada aluno matriculado na educação básica em escolas do Nordeste do Brasil, possui 15.304.589 registros e 103 campos, e, ocupa em disco 3.790.278 KB, ou seja quase 3,8 Gigabytes.\r\nComo esses arquivos estavam separado pelo caracter pipe (|)Este arquivo foi carregado no R utilizando a função read_delim da biblioteca readr:\r\nmatricula_NE <- readr::read_delim(\r\n  file = \"./microdados_educacao_basica_2019/DADOS/MATRICULA_NORDESTE.CSV\",\r\n  delim = \"|\"\r\n)\r\nO R demorou 353,08 segundos para ler esse arquivo do disco e deixar disponível em memória em um formato de dataframe.\r\nSegue abaixo algumas estatísticas relacionadas aos datasets do censo escolar disponibilizados pelo INEP\r\ndataset\r\nregistros\r\ncampos\r\ntamanho (KB)\r\ntempo de leitura (segundos)\r\nDOCENTES_CO\r\n892.665\r\n136\r\n285.874\r\n18,49\r\nDOCENTES_NORDESTE\r\n3.044.057\r\n136\r\n964.596\r\n66,19\r\nDOCENTES_NORTE\r\n1.067.901\r\n136\r\n341.999\r\n22,83\r\nDOCENTES_SUDESTE\r\n4.653.852\r\n136\r\n1.478.987\r\n84,88\r\nDOCENTES_SUL\r\n1.879.896\r\n136\r\n600.905\r\n37,47\r\nESCOLAS\r\n228.521\r\n234\r\n108.590\r\n9,63\r\nApache Parquet\r\nLendo e escrevendo arquivos Parquet com Apache Arrow no R\r\nExiste uma biblioteca no R, de nome arrow, que possui duas funções de fácil utilização, para leitura e escrita de arquivos no formato parquet, respectivamente read_parquet e write_parquet.\r\nPrimeiro, abra o R e instale a biblioteca arrow:\r\ninstall.packages(\"arrow\")\r\nCom a biblioteca arrow já devidamente instalada, para gravar o dataframe disponível em memória em um arquivo parquet no disco, passe como argumento x da função write_parquet o nome do dataframe que deseja salvar, e no argumento sink o diretório e o nome do arquivo parquet:\r\narrow::write_parquet( \r\n  x = matricula_NE,\r\n  sink = \"./microdados_educacao_basica_2019/DADOS/MATRICULA_NORDESTE.parquet\"\r\n)\r\nPara o arquivo MATRICULA_NORDESTE.CSV, O R demorou 1.227,41 segundos para gravar o dataframe em um arquivo parquet no disco. E, o arquivo parquet ocupou em disco 2.008.247 KB, ou seja um compressão de 47,02%.\r\nSegue abaixo algumas estatísticas relacionadas a gravação em disco de dataframe em formato parquet:\r\ndataset\r\nregistros\r\ncampos\r\ntamanho do csv (KB)\r\ntamanho do parquet (KB)\r\nCompressão\r\ntempo de gravação (segundos)\r\nDOCENTES_CO\r\n892.665\r\n136\r\n285.874\r\n31.213\r\n89,1%\r\n4,91\r\nDOCENTES_NORDESTE\r\n3.044.057\r\n136\r\n964.596\r\n122.796\r\n87,3%\r\n15,16\r\nDOCENTES_NORTE\r\n1.067.901\r\n136\r\n341.999\r\n41.464\r\n87,9%\r\n5,89\r\nDOCENTES_SUDESTE\r\n4.653.852\r\n136\r\n1.478.987\r\n151.313\r\n89,8%\r\n24,14\r\nDOCENTES_SUL\r\n1.879.896\r\n136\r\n600.905\r\n78.500\r\n86,9%\r\n11,20\r\nESCOLAS\r\n228.521\r\n234\r\n108.590\r\n16.943\r\n84,4%\r\n9,63\r\nAgora, se deseja ler um arquivo parquet salvo em disco, passe como argumento file da função read_parquet o diretório e o nome do arquivo parquet:\r\nmatricula_NE_Parquet <- arrow::read_parquet(\r\n  file = \"./microdados_educacao_basica_2019/DADOS/MATRICULA_NORDESTE.parquet\"\r\n)\r\nLendo e escrevendo arquivos Parquet com Apache Spark no R\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T13:34:18-03:00",
    "input_file": {}
  },
  {
    "path": "posts/idebr/",
    "title": "Dados do ideb direto do R?",
    "description": "Com o idebr é possível acessar, de forma fácil e leve, dados do índice de desenvolvimento da educação básica, diretamente do R, sem precisar fazer download de nenhum arquivo.",
    "author": [
      {
        "name": "Jonatas Silva do Espirito Santo",
        "url": "https://github.com/jonates/"
      }
    ],
    "date": "2021-01-11",
    "categories": [],
    "contents": "\r\n\r\nbody {\r\ntext-align: justify}\r\nidebr \r\nEste pacote disponibiliza conjuntos de dados, com informações do IDEB - índice de desenvolvimento da educação básica, com as devidas desagregações e estratificações, já no formato tidy, apropriado para geração de visualizações em ggplot2 e que podem serem utilizados em diversas aplicações no R.\r\nAtualmente disponibiliza 6 conjuntos de dados:\r\nideb_fundamental_iniciais_brasil\r\nideb_fundamental_iniciais_escolas\r\nideb_fundamental_finais_brasil\r\nideb_fundamental_finais_escolas\r\nideb_ensino_medio_brasil\r\nideb_ensino_medio_escolas\r\nO ideb_fundamental_iniciais_brasil contem como atributo os valores dos indicadores utilizados para o calculo do IDEB das séries iniciais (1º ao 5º ano) do ensino fundamental para o Brasil, como as taxas de aprovacoes (por serie) e as notas da prova SAEB. Conta tambem com o valor do IDEB e as metas para os anos de 2005, 2007, 2009, 2013, 2015, 2017 e 2019. Tambem estratifica essas informacoes pela rede de ensino.\r\nO ideb_fundamental_iniciais_escolas contem como atributo os valores dos indicadores utilizados para o calculo do IDEB das series iniciais (1º ao 5º ano) do ensino fundamental para as escolas do Brasil, como as taxas de aprovacoes (por serie) e as notas da prova SAEB. Conta tambem com o valor do IDEB e as metas para os anos de 2005, 2007, 2009, 2013, 2015, 2017 e 2019. Tambem estratifica essas informacoes pela rede de ensino.\r\nO ideb_fundamental_finais_brasil contem como atributo os valores dos indicadores utilizados para o calculo do IDEB das séries finais (6º ao 9º ano) do ensino fundamental para o Brasil, como as taxas de aprovacoes (por serie) e as notas da prova SAEB. Conta tambem com o valor do IDEB e as metas para os anos de 2005, 2007, 2009, 2013, 2015, 2017 e 2019. Tambem estratifica essas informacoes pela rede de ensino.\r\nO ideb_fundamental_finais_escolas contem como atributo os valores dos indicadores utilizados para o calculo do IDEB das series finais (6º ao 9º ano) do ensino fundamental para as escolas do Brasil, como as taxas de aprovacoes (por serie) e as notas da prova SAEB. Conta tambem com o valor do IDEB e as metas para os anos de 2005, 2007, 2009, 2013, 2015, 2017 e 2019. Tambem estratifica essas informacoes pela rede de ensino.\r\nO ideb_ensino_medio_brasil contem como atributo os valores dos indicadores utilizados para o calculo do IDEB do ensino medio para o Brasil, como as taxas de aprovacoes (por serie) e as notas da prova SAEB. Conta tambem com o valor do IDEB e as metas para os anos de 2017 e 2019. Tambem estratifica essas informacoes pela rede de ensino.\r\nO ideb_ensino_medio_escolas contem como atributo os valores dos indicadores utilizados para o calculo do IDEB do ensino medio para as escolas do Brasil, como as taxas de aprovacoes (por serie) e as notas da prova SAEB. Conta tambem com o valor do IDEB e as metas para os anos de 2017 e 2019. Tambem estratifica essas informacoes pela rede de ensino.\r\nInstalacao\r\n#Instale o pacote devtoools caso ainda não tenha instalado\r\n#install.packages(devtools)\r\n\r\n#instala o pacote idebr\r\ndevtools::install_github(\"jonates/idebr\")\r\nCarregar conjunto de dados\r\nApos a instalacao do pacote idebr para carregar um conjunto de dados basta digitar no script idebr::nomedodataset. Caso esteja no RStudio, basta digitar ideb:: e apertar a tecla tab que o autocompletar do RStudio vai mostrar todos os conjuntos de dados disponiveis no pacote idebr para que voce possa escolher, conforme imagem abaixo:\r\n\r\nExemplo 1\r\n#carrega a base do ideb do ensino médio do Brasil\r\ndf <- idebr::ideb_ensino_medio_brasil\r\n\r\n#Plot o gráfico do IDEB do Brasil, por ano e por rede de ensino.\r\nlibrary(ggplot2)\r\nggplot(data = df) +\r\n  geom_point(aes(x=ano,y=ideb,colour=rede))\r\n\r\n\r\nRoadmap\r\nEstrato\r\nFundamental - iniciais\r\nFundamental - finais\r\nEnsino Medio\r\nBrasil\r\nOk\r\nOk\r\nOk\r\nRegioes\r\n-\r\n-\r\n-\r\nUF\r\n-\r\n-\r\n-\r\nMunicipios\r\n-\r\n-\r\n-\r\nEscolas\r\nOk\r\nOk\r\nOk\r\n\r\n\r\n\r\n",
    "preview": "posts/idebr/idebr.jpeg",
    "last_modified": "2021-01-13T15:37:46-03:00",
    "input_file": {}
  },
  {
    "path": "posts/contribua/",
    "title": "Envie seu artigo",
    "description": "Contribua com artigos para o Blog.",
    "author": [
      {
        "name": "SEIDataLab",
        "url": "https://github.com/SEIDataLab"
      }
    ],
    "date": "2021-01-08",
    "categories": [],
    "contents": "\r\n\r\nbody {text-align: justify}\r\nNosso objetivo é divulgar trabalhos e pesquisas no âmbito da Ciência de Dados e dados públicos. Sabemos que a comunidade dos dados é bastante ativa e colaborativa, neste sentido abrimos este espaço para que a comunidade possa contibuir enviando seus artigos. Adoraríamos publicar o seu artigo por aqui!\r\nO contato para envio dos artigos pode ser feito por meio do endereço de email seidatalab@sei.ba.gov.br\r\nComo este blog é totalmente construído em Distill for Markdown, apreciamos artigos que sejam enviados no formato R Markdown. Para dicas em como escrever o artigo em R Markdown sugerimos o cheat sheet da RStudio\r\nMetadados\r\nAlgumas informações sobre metadados são necessárias para a publicação de artigos no blog. Deixamos a seguir um exemplo com os metadados necessários para a publicação no blog:\r\n\r\n---\r\ntitle: \"Título do Artigo\"\r\ndescription: |\r\n  Subtítulo: Breve descrição sobre o artigo.\r\nauthor:\r\n  - name: Nome e Sobrenome do autor \r\n    url: url de endereço do autor (exemplo: linkedin, github ou site pessoal)\r\n    affiliation: vinculação institucional do autor\r\n    affiliation_url: url de endereço da vinculação autor (se houver)\r\ndate: mm-dd-yyyy # data da publicação\r\ncreative_commons: CC BY #licença creative commons\r\nrepository_url: link do repositório (github) do código (se houver)\r\noutput: \r\n  distill::distill_article:\r\n    self_contained: false\r\n---\r\n\r\nNo campo author devem ser colocadas as características do autor ou autores (podem ser incluídos vários autores), bem como sua afiliação. Observe também o campo da licença creative_commons, que marca o artigo como podendo ser compartilhado (todos os posts enviados devem ter uma licença Creative Commons possibilitando o compartilhamento). Finalmente, o repository_url é usado para fornecer links do artigo, base de dados ou códigos hospodados no GitHub.\r\nEstamos aguardando para publicar o seu artigo!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-17T10:15:15-03:00",
    "input_file": {}
  },
  {
    "path": "posts/sobre_o_seidatalab/",
    "title": "Sobre o SeiDataLab",
    "description": "O que é o SEIDataLab?",
    "author": [
      {
        "name": "Rodrigo Cerqueira",
        "url": "https://www.linkedin.com/in/rodrigobcerqueira/"
      }
    ],
    "date": "2021-01-07",
    "categories": [],
    "contents": "\r\n\r\nbody {text-align: justify}\r\nO SEIDataLab é o laboratório de dados da Superintendência de Estudos Econômicos e Sociais da Bahia (SEI), focado em análise de dados e geração de insights, auxiliando decisões de políticas públicas estaduais.\r\nCriado em 2019, como um desdobramento do Grupo de Trabalho (GT) de Business Intelligence, Big Data e Ciência de Dados, publicado na Portaria nº 18 de 05 de setembro de 2019, o SEIDataLab surgiu, a partir da percepção da área técnica de diferentes Coordenações e Diretorias da SEI, acerca das necessidade de sistematizar conceitos, técnicas e procedimentos em Ciência de Dados e atividades correlatas no âmbito da Superintendência.\r\nO objetivo do laboratório é colocar a SEI na vanguarda da geração de insights para a formulação de políticas públicas orientadas a dados e avançar a inserção cada vez maior do Estadao da Bahia na era do Governo 4.0 e gestão pública orientada a dados.\r\nAtualmente o laboratório construiu e administra o primeiro Data Lake, integrado a um Cluster de Processamento Paralelo de grandes bases de dados do Governo do Estado, construído com o que há de mais moderno no atual cenário das ferramentas de Big Data, como Apache Spark, Apache Ranger e Presto.\r\n\r\n\r\n\r\n",
    "preview": "posts/sobre_o_seidatalab/SeiDataLab.png",
    "last_modified": "2021-01-13T15:37:46-03:00",
    "input_file": {},
    "preview_width": 743,
    "preview_height": 292
  }
]
